{
  "name": "sequential",
  "trainable": true,
  "dtype": {
    "module": "keras",
    "class_name": "DTypePolicy",
    "config": {
      "name": "float32"
    },
    "registered_name": null
  },
  "layers": [
    {
      "module": "keras.layers",
      "class_name": "InputLayer",
      "config": {
        "batch_shape": [
          null,
          64025
        ],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "input_layer"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 256,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          64025
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "dropout",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.3,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 128,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          256
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 1,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          128
        ]
      }
    }
  ],
  "build_input_shape": [
    null,
    64025
  ]
}